grevaillot/svd_tools/headers/STM32F7x3/otg_hs_device.h
/** @defgroup otg_hs_device_otg_hs_doeptsiz0 OTGHSDOEPTSIZ0 OTG_HS device endpoint-0 transfer size register
@{*/


#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ0_STUPCNT_SHIFT		29
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ0_STUPCNT_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_doeptsiz0_stupcnt STUPCNT SETUP packet count
@{*/
/**@}*/

/** OTG_HS_DEVICE_OTG_HS_DOEPTSIZ0_PKTCNT Packet count **/
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ0_PKTCNT		(1 << 19)

#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ0_XFRSIZ_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ0_XFRSIZ_MASK		0x7f
/** @defgroup otg_hs_device_otg_hs_doeptsiz0_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_doepdma0 OTGHSDOEPDMA0 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_doepctl1 OTGHSDOEPCTL1 OTG device endpoint-1 control register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DOEPCTL1_EPENA Endpoint enable **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_EPENA		(1 << 31)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL1_EPDIS Endpoint disable **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_EPDIS		(1 << 30)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL1_SODDFRM Set odd frame **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_SODDFRM		(1 << 29)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL1_SD0PID_SEVNFRM Set DATA0 PID/Set even frame **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_SD0PID_SEVNFRM		(1 << 28)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL1_SNAK Set NAK **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_SNAK		(1 << 27)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL1_CNAK Clear NAK **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_CNAK		(1 << 26)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL1_Stall STALL handshake **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_Stall		(1 << 21)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL1_SNPM Snoop mode **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_SNPM		(1 << 20)

#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_EPTYP_SHIFT		18
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_EPTYP_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_doepctl1_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_DEVICE_OTG_HS_DOEPCTL1_NAKSTS NAK status **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_NAKSTS		(1 << 17)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL1_EONUM_DPID Even odd frame/Endpoint data PID **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_EONUM_DPID		(1 << 16)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL1_USBAEP USB active endpoint **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_USBAEP		(1 << 15)

#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_MPSIZ_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_device_otg_hs_doepctl1_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_doepint1 OTGHSDOEPINT1 OTG_HS device endpoint-1 interrupt register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DOEPINT1_NYET NYET interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT1_NYET		(1 << 14)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT1_B2BSTUP Back-to-back SETUP packets received **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT1_B2BSTUP		(1 << 6)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT1_OTEPDIS OUT token received when endpoint disabled **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT1_OTEPDIS		(1 << 4)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT1_STUP SETUP phase done **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT1_STUP		(1 << 3)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT1_EPDISD Endpoint disabled interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT1_EPDISD		(1 << 1)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT1_XFRC Transfer completed interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT1_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_device_otg_hs_doeptsiz1 OTGHSDOEPTSIZ1 OTG_HS device endpoint-1 transfer size register
@{*/


#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ1_RXDPID_STUPCNT_SHIFT		29
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ1_RXDPID_STUPCNT_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_doeptsiz1_rxdpid_stupcnt RXDPIDSTUPCNT Received data PID/SETUP packet count
@{*/
/**@}*/


#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ1_PKTCNT_SHIFT		19
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ1_PKTCNT_MASK		0x3ff
/** @defgroup otg_hs_device_otg_hs_doeptsiz1_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ1_XFRSIZ_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ1_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_hs_device_otg_hs_doeptsiz1_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_doepdma1 OTGHSDOEPDMA1 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_doepctl2 OTGHSDOEPCTL2 OTG device endpoint-2 control register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DOEPCTL2_EPENA Endpoint enable **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_EPENA		(1 << 31)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL2_EPDIS Endpoint disable **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_EPDIS		(1 << 30)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL2_SODDFRM Set odd frame **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_SODDFRM		(1 << 29)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL2_SD0PID_SEVNFRM Set DATA0 PID/Set even frame **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_SD0PID_SEVNFRM		(1 << 28)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL2_SNAK Set NAK **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_SNAK		(1 << 27)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL2_CNAK Clear NAK **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_CNAK		(1 << 26)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL2_Stall STALL handshake **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_Stall		(1 << 21)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL2_SNPM Snoop mode **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_SNPM		(1 << 20)

#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_EPTYP_SHIFT		18
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_EPTYP_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_doepctl2_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_DEVICE_OTG_HS_DOEPCTL2_NAKSTS NAK status **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_NAKSTS		(1 << 17)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL2_EONUM_DPID Even odd frame/Endpoint data PID **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_EONUM_DPID		(1 << 16)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL2_USBAEP USB active endpoint **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_USBAEP		(1 << 15)

#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_MPSIZ_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_device_otg_hs_doepctl2_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_doepint2 OTGHSDOEPINT2 OTG_HS device endpoint-2 interrupt register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DOEPINT2_NYET NYET interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT2_NYET		(1 << 14)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT2_B2BSTUP Back-to-back SETUP packets received **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT2_B2BSTUP		(1 << 6)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT2_OTEPDIS OUT token received when endpoint disabled **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT2_OTEPDIS		(1 << 4)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT2_STUP SETUP phase done **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT2_STUP		(1 << 3)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT2_EPDISD Endpoint disabled interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT2_EPDISD		(1 << 1)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT2_XFRC Transfer completed interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT2_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_device_otg_hs_doeptsiz2 OTGHSDOEPTSIZ2 OTG_HS device endpoint-2 transfer size register
@{*/


#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT_SHIFT		29
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_doeptsiz2_rxdpid_stupcnt RXDPIDSTUPCNT Received data PID/SETUP packet count
@{*/
/**@}*/


